# 
brew "wget"
brew "openssl"
brew "readline"
brew "curl"
brew "git"

# Finally I am converted
brew "zsh"

# brew "vim"

brew "aspell"
brew "tree"
brew "yarn"
brew "pandoc"
brew "jq"
brew "re2"
brew "ssh-copy-id"
brew "w3m"
brew "datamash"
brew "zlib"

brew "heroku"

brew "postgres"

# Languages

brew "swi-prolog"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "ruby-build"
brew "rust"
brew "goenv"
brew "nvm"

# Development tools
brew "prettier"

# Tools
brew "tmux"
# brew "tmux-mem-cup-load"
brew "gnuplot"

# Machine learning
# brew "tesseract"
# brew "tesseract-lang"

# 
# Cask
#
cask_args appdir: "~/Applications"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

cask "emacs"
cask "notion"
cask "dropbox"

# Passord manager
# cask "macpass"
cask "bitwarden"
cask "1password"
cask "1password-cli"

# GUI Diff Tools
# outdated offline comparison tools 
# cask "p4v"

# Browser War
cask "google-chrome"
cask "firefox"
cask "brave-browser"
cask "microsoft-edge"

# For development use
cask "firefox-developer-edition"
cask "google-chrome-canary"

# Development tools
cask "docker"
cask "iterm2"
cask "postman"

# Media player
cask "vlc"
cask "spotify"

# Database GUI client
# cask "sequel-pro"
# cask "mysqlworkbench"
cask "dbeaver-community" # require jdk
cask "adoptopenjdk"

# eReader
cask "calibre"

# github Desktop tool
cask "github"

# Screenshot app
cask "skitch"

# Communications
cask "slack"
cask "skype"
cask "wechat"
cask "zoomus"
cask "whatsapp"
cask "loom"

# fonts
cask "font-hack-nerd-font"
cask "font-meslolg-nerd-font"

# Misc
cask "private-internet-access"

# drawing
# cask "krita"

# cask "mactex"

# Fun
# emoji
cask "rocket"
