cask_args appdir: "~/Applications"

tap "homebrew/cask"

brew "wget"
brew "openssl"
brew "readline"
brew "curl"

brew "git"
brew "zsh"

# brew "bash-git-prompt"

brew "vim"

brew "aspell"
brew "tree"
brew "yarn"
brew "pandoc"
brew "jq"
brew "re2"
brew "ssh-copy-id"
brew "w3m"
brew "datamash"

brew "heroku"

brew "postgres"

brew "zlib"

# languages

brew "swi-prolog"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "ruby-build"
brew "rust"
brew "goenv"
brew "nvm"

# Development tools

brew "prettier"

# Terminals

brew "tmux"
# brew "tmux-mem-cup-load"

# brew "screen"

# brew "gnuplot"

# Machine learning

# brew "tesseract"
# brew "tesseract-lang"


cask "emacs"

cask "macpass"

# GUI Diff Tools
cask "p4v"

# Browser War

cask "google-chrome"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome-canary"
cask "brave-browser"

# Development

cask "docker"

# Media player
cask "vlc"
cask "spotify"

# Mysql GUI client
# cask "sequel-pro"
# cask "mysqlworkbench"
# cask "dbeaver-community"

# eReader
cask "calibre"

# Screenshot app
cask "skitch"

# Communications
cask "slack"
cask "skype"
cask "wechat"
cask "zoomus"
cask "whatsapp"

# fonts
cask "font-ubuntu-mono-derivative-powerline"
cask "font-fira-mono-for-powerline"
cask "font-source-code-pro-for-powerline"

#
cask "iterm2"

# Misc
cask "private-internet-access"

# drawing
# cask "krita"

# cask "mactex"

